# GetNumLBColumns

## Description
Gets the number of columns in the specified list browser control.

```pascal
FUNCTION GetNumLBColumns(
				dialogID    : LONGINT;
				componentID : LONGINT): INTEGER;
```

```python
def vs.GetNumLBColumns(dialogID, componentID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser